/* Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт какое число большее, а какое меньшее.
Console.Write("Input a first number: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a second number: ");
int b = Convert.ToInt32(Console.ReadLine());
int max = a;

if(a > b)
{
    Console.WriteLine($"max number is {a}");
}
else
{
    Console.WriteLine($"max number is {b}");
}
*/
